ddm-bpm-extension/src/it/resources/xml/IDPexchangeServiceResponse.xml

<?xml version="1.0" encoding="utf-8"?>
<!--
  ~ Copyright 2021 EPAM Systems.
  ~
  ~ Licensed under the Apache License, Version 2.0 (the "License");
  ~ you may not use this file except in compliance with the License.
  ~ You may obtain a copy of the License at
  ~
  ~    https://www.apache.org/licenses/LICENSE-2.0
  ~
  ~ Unless required by applicable law or agreed to in writing, software
  ~ distributed under the License is distributed on an "AS IS" BASIS,
  ~ WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  ~ See the License for the specific language governing permissions and
  ~ limitations under the License.
  -->

<soap11env:Envelope xmlns:soap11env="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:tns="http://ioc.gov.ua/IDPexchangeService" xmlns:xroad="http://x-road.eu/xsd/xroad.xsd"
  xmlns:id="http://x-road.eu/xsd/identifiers">
  <soap11env:Header>
    <tns:AuthorizationToken>token</tns:AuthorizationToken>
    <xroad:client id:objectType="SUBSYSTEM">
      <id:xRoadInstance>CLIENT-TEST</id:xRoadInstance>
      <id:memberClass>GOV</id:memberClass>
      <id:memberCode>666777666</id:memberCode>
      <id:subsystemCode>GOV_TEST</id:subsystemCode>
    </xroad:client>
    <xroad:service id:objectType="SERVICE">
      <id:xRoadInstance>IDP-TEST</id:xRoadInstance>
      <id:memberClass>GOV</id:memberClass>
      <id:memberCode>11115888</id:memberCode>
      <id:subsystemCode>IDP_test</id:subsystemCode>
      <id:serviceCode>IDPexchangeService</id:serviceCode>
    </xroad:service>
    <xroad:protocolVersion>4.0</xroad:protocolVersion>
    <xroad:id>DDM</xroad:id>
  </soap11env:Header>
  <soap11env:Body>
    <tns:AppDataRes>
      <tns:ResponceStr>eyJpZCI6IjEyMyIsICJuYW1lIjogImxhYk5hbWUifQ==</tns:ResponceStr>
    </tns:AppDataRes>
  </soap11env:Body>
</soap11env:Envelope>